{
  "header": {
    "acronym": "MLLS",
    "subtitle": "4th Workshop on",
    "title": "Machine Learning in Life Sciences",
    "info": [
      "23 September 2016",
      "Riva del Garda, Italy"
    ],
    "organizedUnder": "European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases 2016"
  },
  "chairs": [
    "Dr. Bartosz Krawczyk, Wroclaw University of Technology, Poland",
    "Prof. Michał Woźniak, Wroclaw University of Technology, Poland",
    "Prof. Krzysztof Cios, Virginia Commonwealth University, USA",
    "Prof. Igor Podolak, Jagiellonian University, Poland",
    "Prof. Tomislav Smuc, Rudjer Boskovic Institute, Croatia"
  ],
  "description": [
    "Life sciences, ranging from medicine, biology and genetics to biochemistry and pharmacology have developed rapidly in previous years. Computerization of those domains allowed to gather and store enormous collections of data. Analysis of such vast amounts of information without any support is impossible for human being. Therefore recently machine learning and pattern recognition methods have attracted the attention of broad spectrum of experts from life sciences domain.",
    "The aim of this Workshop is to stress the importance of interdisciplinary collaboration between life and computer sciences and to provide an international forum for both practitioners seeking new cutting-edge tools for solving their domain problems and theoreticians seeking interesting and real-life applications for their novel algorithms. We are interested in novel machine learning technologies, designed to tackle complex medical, biological, chemical or environmental data that take into consideration the specific background knowledge and interactions between the considered problems. We look for novel applications of machine learning and pattern recognition tools to contemporary life sciences problems, that will shed light on their strengths and weaknesses. We are interested in new methods for data visualization and methods for accessible presentation of results of machine learning analysis to life scientists. We welcome new findings in the intelligent processing of non-stationary medical, biological and chemical data and in proposals for efficient fusion of information coming from multiple sources. Papers on efficient analysis and classification of bid data (understood as both massive volumes and high-dimensionality problems) will be of special interest to this Workshop."
  ],
  "topics": [
    "novel machine learning and pattern recognition models for analyzing medical, biological and chemical data;",
    "new models for efficient, fast and effective processing of big, massive and multi-dimensional life sciences data;",
    "intelligent methods for analysis of microarrays, gene and protein modeling, biological networks, docking etc;",
    "automatic drug design with machine learning methods, QSAR / QSPR modeling;",
    "methods for data visualization and accessible presentation of machine learning results / findings to domain experts (doctors, biologists, chemists etc);",
    "new developments in ensemble, compound and hybrid classification for life sciences;",
    "methods for incorporating background knowledge into machine learning systems;",
    "recent developments in complex data pre-processing: feature selection, noise filtering, class imbalance etc;"
  ],
  "sections": [
    {
      "title": "Submissions",
      "body": [
        "The page limit is 12 pages, format as in <a href='https://www.springer.com/computer/lncs?SGWID=0-164-6-793341-0'>standard Springer LNCS</a>. Please submit your work directly to <a href='mailto:bartosz.krawczyk@pwr.edu.pl'>Bartosz Krawczyk via e-mail</a>."
      ]
    },
    {
      "title": "Journal Special Issue",
      "body": [
        "Extended versions of accepted papers will be invited to special issue of a journal (with IF>1, we are currently finishing negotiations with a potential venue)."
      ]
    }
  ],
  "plenary" : {
    "name": "Jerzy Stefanowski",
    "face": "http://ideal2015.pwr.edu.pl/img/stefanowski.jpg",
    "biogram": "Jerzy Stefanowski is a professor of Poznan University of Technology, Institute of Computing Science. He received his Ph.D. and Habilitation degrees from the same University. His research interests include knowledge discovery, data mining, machine learning and intelligent decision support. Major results are concerned with: induction of various types of rules, multiple classifiers, mining class - imbalanced data, incremental learning from evolving data streams, data preprocessing, generalizations of rough set theory, descriptive clustering of documents and medical applications. He is the author and co-author of over 170 research papers and 2 books. In addition to his research activities he served in a number of organizational capacities, as e.g.: Former President of Wielkopolska Regional Branch of Polish Information Processing Society (2006-2011), current member of the Executive Board of Polish Artificial Intelligence Society; co-founder and co-leader of Polish Special Interest Group on Machine Learning. Moreover, since 2012 he is the Editor in Chief of Foundations of Computing and Decision Science journal.",
    "title": "Evaluation of Interestingness and Interaction of Attribute-Value Conditions in Discovered Rules: Applications in Medical Data Analysis"
  },
  "commitees": [
    {
      "name": "PC Commitee",
      "members": [
        "Bogusław Cyganek, AGH University of Science and Technology, Poland",
        "Wojciech Czarnecki, Jagiellonian University, Poland",
        "Saso Dzeroski, Jozef Stefan Institute, Slovenia",
        "Mikel Galar, Public University of Navarra, Spain",
        "Dragan Gamberger, Rudjer Boskovic Institute, Croatia",
        "Manuel Graña, University of the Basque Country, Spain",
        "Dragi Kocev, Jozef Stefan Institute, Slovenia",
        "Lukasz Kurgan, Virginia Commonwealth University, USA",
        "Katarzyna Wegrzyn-Wolska, ESIGETEL, France",
        "Mohamed Medhat Gaber, Robert Gordon University, UK",
        "Jose Antonio Saez, University of Granada, Spain",
        "Fran Supek; Centre for Genomic Regulation, Spain",
        "Jacek Tabor, Jagiellonian University, Poland",
        "Isaac Triguero, Ghent University, Belgium"
      ]
    }
  ],
  "dates": [
    {
      "date": "July 18, 2016",
      "description": "Workshop paper submission deadline"
    },
    {
      "date": "July 25, 2016",
      "description": "Workshop paper acceptance notification"
    },
    {
      "date": "August 8, 2016",
      "description": "Workshop paper camera-ready deadline"
    }
  ]
}