{
    "color": "#0000FF",
    "header": {
        "acronym": "CAPRI",
        "subtitle": "Workshop on",
        "title": "Computational Aspects of Pattern Recognition and Computer Vision with Neural Systems",
        "info": [
            "14—19 May 2016",
            "Anchorage, Alaska, USA"
        ],
        "organizedUnder": "the framework of the International Joint Conference on Neural Networks (IJCNN 2017) "
    },
    "description": [
        "Computational requirements on information processing systems are nowadays enormous - not only huge amounts of data needs to be processed and classified but also the systems need to deal with massive data usually in the form of data streams and frequently real-time processing requirements. On the other hand, neural systems proved their great potential, especially in pattern recognition and computer vision. However, all of the above rely heavily on efficient algorithms and continuously improved implementations. Therefore computational aspects become a key issue in pattern recognition and computer vision.",
        "In this workshop we wish to collect researchers and practitioners to share interesting research topics and ideas especially in the area of computational aspects of pattern recognition and computer vision processed on all types of neural systems, starting from algorithm design and up to implementations and applications, encountered in computer vision and pattern recognition computer vision for information mining, especially form from massive data streams and new neural architectures."
    ],
    "topics": [
        "Parallel implementations of pattern recognition and computer vision neural systems",
        "Deep learning – techniques and new achievements in computer vision with special stress on image enhancement for pattern recognition",
        "Real-time neural systems, their implementation and application",
        "Rapid neural system development – new directions and platforms",
        "Graphic card (GPU) implementations of pattern recognition and computer vision systems",
        "Hardware implementations (FPGA) of pattern recognition and computer vision systems",
        "New algorithms for efficient computations on pattern recognition and computer vision neural systems",
        "Tips and tricks in pattern recognition and computer vision algorithms",
        "Industrial applications of pattern recognition and computer vision, especially with dedicated streaming data",
        "Computational aspects in all kinds of massive and streaming data",
        "Pattern recognition in computer vision, multimedia, and image processing",
        "Multilinear and tensor approach to data representation and pattern recognition",
        "Active learning for neural based pattern recognition and computer vision",
        "Hyperspectral image processing",
        "Pattern recognition in hyperspectral images",
        "Visualisation and sonnification for high dimensional data"
    ],
    "sections": [{
            "title": "Submissions",
            "body": [
                "Accepted papers will be published in on-line proceedings with ISBN. The page limit is 12 pages, format as in <a href='https://www.springer.com/computer/lncs?SGWID=0-164-6-793341-0'>standard Springer LNCS</a>.",
                "Please submit your work via <a href='https://easychair.org/conferences/?conf=capri2017'>easychair</a>."
            ]
        },
        {
            "title": "Contact",
            "body": [
                "Boguslaw Cyganek<br><a href='mailto:cyganek@agh.edu.pl'>cyganek@agh.edu.pl</a><br><a href='http://home.agh.edu.pl/~cyganek/'>http://home.agh.edu.pl/~cyganek/</a>"
            ]
        }
    ],
    "commitees": [{
            "name": "Program Committee (tentative)",
            "members": [
                "Boguslaw Cyganek, AGH University of Science and Technology, Poland - chair",
                "Michal Wozniak, Wroclaw University of Science and Technology, Poland - chair",
                "Tomasz Andrysiak, University of Technology and Life Sciences, Poland",
                "Colin Bellinger, University of Alberta, Canada",
                "Robert Burduk – Wroclaw University of Science and Technology, Poland",
                "Alberto Cano, Virginia Commonwealth University, USA",
                "Alberto Fernandez, University of Granda, Spain",
                "Mikel Galar, Public University of Navarra, Spain",
                "Manuel Graña, University of the Basque Country, Spain",
                "Dariusz Jankowski, Wroclaw University of Science and Technology, Poland",
                "Bartosz Krawczyk, Virginia Commonwelth University, Richmond, USA",
                "Paweł Ksieniewicz, Wroclaw University of Science and Technology, Poland",
                "Piotr Porwik, University of Silesia, Poland",
                "Alex Savio, Klinikum rechts der Isar, TUM, München",
                "Radek Silhavy, Tomas Bata University in Zlin, Czech Republic",
                "Dragan Simic, University of Novi Sad, Serbia",
                "Isaac Triguero, University of Nottingham, UK",
                "Richard Zurawski, ISA Group, CA, USA"
            ]
        },
        {
            "name": "Organizing Committe",
            "members": [
                "Paweł Ksieniewicz, Wroclaw University of Science and Technology, Poland",
                "Dariusz Jankowski, Wroclaw University of Science and Technology, Poland - chair",
                "Michał Koziarski, Wroclaw University of Science and Technology, Poland",
                "Jakub Nawała, AGH University of Science and Technology, Poland"
            ]
        }
    ],
    "dates": [{
            "description": "Paper submission",
            "date": "February 28th, 2017"
        },
        {
            "description": "Notification of papers’ acceptance/rejection",
            "date": "March 8th, 2017"
        },
        {
            "description": "Camera-ready papers",
            "date": "March 15th, 2017"
        },
        {
            "description": "Author registration",
            "date": "March 20th, 2017"
        },
        {
            "description": "Workshop sessions",
            "date": "May 14th, 2017"
        }
    ]
}
